_Rarzrabotki/Rarus/USO2/Catalogs/СМ_НормативныеСборники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>СМ_НормативныеСборники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДлинноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ЕдиницыИзмеренияСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Измеритель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодНормативнойРасценки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассаБруттоТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассаНеттоТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Определитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_Определители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНормативногоСборника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ТипыНормативныхСборников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньЦен</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ДатыБазисныхЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаРесурсов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ГруппыРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СметноНормативнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_СметноНормативныеБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_СтатусыФормированияНормативов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦеныНормативныхСборников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РегиональнаяБаза</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СМ_СметноНормативныеБазы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Район</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СМ_ТерриториальныеРайоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрямыеЗатраты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнаяЗарплата</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭксплуатацияМашинИМеханизмов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВТомЧислеЗарплатаМашинистов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьМатериалов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозвратМатериалов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьОборудования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НакладныеРасходыСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СметнаяПрибыльСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентНР</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗатратыТрудаРабочих</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РесурсыНормативныхСборников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ресурс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СМ_Ресурсы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипРесурса</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СМ_ТипыМатериалов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаРасхода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеРесурса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмеренияРесурса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодРесурса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставРабот</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеРаботы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_СтатусыФормированияНормативов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_СтатусыФормированияНормативов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ТипыМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ТипыМатериалов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоПроекту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Учтенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУчтенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МестныйМатериал</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ТипыЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ТипыЦен</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Базисная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Текущая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ВидыРесурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ВидыРесурсов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗатратыТрудаРабочих</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗатратыТрудаМашинистов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МашиныИМеханизмы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Справочно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перебазировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Транспортировка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ВидыРасценки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ВидыРасценки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Транспортировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МебельИнвентарь</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/СМ_СметноНормативныеБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>СМ_СметноНормативныеБазы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодВыпуска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ГодыВыпускаБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРегиона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойТипКоэффициентов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ВидыИндексов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Правообладатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньБазы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_УровниБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаРесурсов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ГруппыРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Районы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТерриториальныйРайон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СМ_ТерриториальныеРайоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/СМ_НормативныеСборники/Forms/ФормаЭлементаУправляемая/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда 
		
		СМ_СметаВызовСервера.ЗаполнитьНСИПользователяПоУмолчанию(Объект);
	
		Если ЗначениеЗаполнено(Объект.Родитель) Тогда
			Объект.УровеньЦен 				= Объект.Родитель.УровеньЦен;
			Объект.ТипНормативногоСборника 	= Объект.Родитель.ТипНормативногоСборника;
			Объект.ГруппаРесурсов           = Объект.Родитель.ГруппаРесурсов;
			Объект.СметноНормативнаяБаза    = Объект.Родитель.СметноНормативнаяБаза;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.СметноНормативнаяБаза) Тогда
			Объект.СметноНормативнаяБаза = Справочники.СМ_СметноНормативныеБазы.ПолучитьБазуПоУмолчанию();
		КонецЕсли;
		
		Объект.Статус = Перечисления.СМ_СтатусыФормированияНормативов.ВРаботе;
		
	КонецЕсли;

	ИнициализацияПеременныхНаСервере();
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "СтраницаДополнительныеРеквизиты");
		ДополнительныеПараметры.Вставить("ОтложеннаяИнициализация", Ложь);
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РедактироватьСоставСвойств()
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеСвойствамиКлиент");
		МодульУправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтотОбъект, Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
	
КонецПроцедуры   

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеСвойствамиКлиент");
		МодульУправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеСвойствамиКлиент");
		МодульУправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьОтображение();
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПроверитьЗначения(Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбновитьОтображение(); 
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ЕдиницаИзмеренияПриИзменении(Элемент)
	Объект.Измеритель = Строка(Объект.ЕдиницаИзмерения);
КонецПроцедуры

&НаКлиенте
Процедура РесурсыНормативныхСборниковТипРесурсаПриИзменении(Элемент)
	Если Элементы.РесурсыНормативныхСборников.ТекущиеДанные.ТипРесурса = ПредопределенноеЗначение("Перечисление.СМ_ТипыМатериалов.ПоПроекту") Тогда
		Элементы.РесурсыНормативныхСборников.ТекущиеДанные.НормаРасхода = 0;
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ЦеныНормативныхСборниковНакладныеРасходыСуммаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ЦеныНормативныхСборников.ТекущиеДанные;
	ОЗ 		= ТекущиеДанные.ОсновнаяЗарплата;
	ЗМ 		= ТекущиеДанные.ВТомЧислеЗарплатаМашинистов;
	НР 		= ТекущиеДанные.НакладныеРасходыСумма;
	ТекущиеДанные.ПроцентНР=(НР/(ОЗ+ЗМ))*100;
КонецПроцедуры

&НаКлиенте
Процедура ЦеныНормативныхСборниковСметнаяПрибыльСуммаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ЦеныНормативныхСборников.ТекущиеДанные;
	ОЗ 		= ТекущиеДанные.ОсновнаяЗарплата;
	ЗМ 		= ТекущиеДанные.ВТомЧислеЗарплатаМашинистов;
	СП 		= ТекущиеДанные.СметнаяПрибыльСумма;
	ТекущиеДанные.ПроцентСП=(СП/(ОЗ+ЗМ))*100;	
КонецПроцедуры

&НаКлиенте
Процедура РодительПриИзменении(Элемент)
	ДанныеФормы = ЭтаФорма.Объект;
	ЗаполнитьНаОсновании(ДанныеФормы);
	КопироватьДанныеФормы(ДанныеФормы, ЭтаФорма.Объект);
КонецПроцедуры

&НаКлиенте
Процедура ОпределительПриИзменении(Элемент)
	ВидРасценки = СМ_СметаВызовСервера.ПолучитьЗначениеРеквизита(Объект.Определитель, "ВидРасценки");
	ОбновитьОтображение();
КонецПроцедуры

&НаКлиенте
Процедура ЦеныНормативныхСборниковПриИзменении(Элемент)
	
	ТекДанные = Элементы.ЦеныНормативныхСборников.ТекущиеДанные;
	РассчитатьЗначенияТаблицы(ТекДанные);
	
	ТекДанные = Элементы.ЦеныНормативныхСборников.ТекущиеДанные;
	НайденныеСтроки = Объект.ЦеныНормативныхСборников.НайтиСтроки(Новый Структура("РегиональнаяБаза,Район",ТекДанные.РегиональнаяБаза,ТекДанные.Район));
	Если НайденныеСтроки.Количество() > 1 Тогда
		Объект.ЦеныНормативныхСборников.Удалить(Объект.ЦеныНормативныхСборников.Индекс(ТекДанные));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Строка с такими полями уже есть в табличной части'"));
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РасчетПоЦенамРесурсов(Команда)
	
	РасчетПоЦенеРесурсов();
	
КонецПроцедуры

&НаСервере
Процедура ИнициализацияПеременныхНаСервере()
	
	ВидРасценки = Объект.Определитель.ВидРасценки;
		
КонецПроцедуры

&НаКлиенте
Процедура РасчетПоЦенеРесурсов()

	Если Объект.ЦеныНормативныхСборников.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Добавьте строку стоимости в таблицу цен, после чего нажмите кнопку Расчет повторно'"));
		Возврат; 
	КонецЕсли;
	
	Если Элементы.ЦеныНормативныхСборников.ТекущиеДанные = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Выберите строку стоимости в таблицу цен, после чего нажмите кнопку Расчет повторно'"));
		Возврат;
	КонецЕсли;
	
	Район = Элементы.ЦеныНормативныхСборников.ТекущиеДанные.Район;
	РегиональнаяБаза = Элементы.ЦеныНормативныхСборников.ТекущиеДанные.РегиональнаяБаза;
	
	Если Не ЗначениеЗаполнено(Район) ИЛИ Не ЗначениеЗаполнено(РегиональнаяБаза)  Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Для расчета требуется выбрать в текщей строке Район и Смето-нормативную базу'"));
		Возврат;
	КонецЕсли;
		
	РасчетПоЦенамРесурсовСервер(Район, РегиональнаяБаза);
	
	РассчитатьЗначенияТаблицы(Элементы.ЦеныНормативныхСборников.ТекущиеДанные);
			
КонецПроцедуры

// Процедура выполняет расчет по ценам ресурсов.
&НаСервере
Процедура РасчетПоЦенамРесурсовСервер(Район, РегиональнаяБаза)
	
	СуммаОЗ = 0;
	СуммаЭММ = 0;
	СуммаСМ = 0;
	СуммаЗМ = 0;

	Если Объект.ЦеныНормативныхСборников.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Добавьте строку стоимости'"));
		Возврат; 
	КонецЕсли;
	
	ОтборСтруктура = Новый Структура();
	ОтборСтруктура.Вставить("Район", Район);
	ОтборСтруктура.Вставить("РегиональнаяБаза", РегиональнаяБаза);
	
	Строки = Объект.ЦеныНормативныхСборников.НайтиСтроки(ОтборСтруктура);
	Если Строки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Для расчета требуется выбрать Район и Смето-нормативную базу'"));
		Возврат;
	ИначеЕсли Строки.Количество() > 1 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='В таблице не может быть одинаковых районов и нормативных баз'"));
		Возврат;
	Иначе
		СтрокаЦен = Строки[0];
	КонецЕсли;
	
	Если Район = Справочники.СМ_ТерриториальныеРайоны.ПустаяСсылка() ИЛИ РегиональнаяБаза = Справочники.СМ_СметноНормативныеБазы.ПустаяСсылка()  Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Для расчета требуется выбрать Район и Смето-нормативную базу'"));
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РесурсыИзДокумента.Ресурс,
		|	РесурсыИзДокумента.НормаРасхода,
		|	РесурсыИзДокумента.ТипРесурса
		|ПОМЕСТИТЬ ВременнаяТаблицаРесурсов
		|ИЗ
		|	&ТаблицаРесурсовИзДокумента КАК РесурсыИзДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаРесурсов.Ресурс,
		|	ВременнаяТаблицаРесурсов.НормаРасхода,
		|	ЕСТЬNULL(СметныеЦеныРесурсовСрезПоследних.СметнаяЦена, 0) КАК СметнаяЦена,
		|	ВременнаяТаблицаРесурсов.НормаРасхода * ЕСТЬNULL(СметныеЦеныРесурсовСрезПоследних.СметнаяЦена, 0) КАК СтоимостьРесурса,
		|	СметныеЦеныРесурсовСрезПоследних.Ресурс.ВидРесурса КАК ВидРесурса,
		|	ВременнаяТаблицаРесурсов.ТипРесурса,
		|	ЕСТЬNULL(СметныеЦеныРесурсовСрезПоследних.ЗарплМашинистов, 0) КАК ЗарплатаМашинистов
		|ИЗ
		|	ВременнаяТаблицаРесурсов КАК ВременнаяТаблицаРесурсов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_СметныеЦеныРесурсов.СрезПоследних КАК СметныеЦеныРесурсовСрезПоследних
		|		ПО ВременнаяТаблицаРесурсов.Ресурс = СметныеЦеныРесурсовСрезПоследних.Ресурс
		|			И (СметныеЦеныРесурсовСрезПоследних.СметноНормативнаяБаза = &СНБ)
		|			И (СметныеЦеныРесурсовСрезПоследних.Район = &Район)
		|			И (СметныеЦеныРесурсовСрезПоследних.ТипЦен = ЗНАЧЕНИЕ(Перечисление.СМ_ТипыЦен.Базисная))
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаРесурсов.Ресурс,
		|	ВременнаяТаблицаРесурсов.НормаРасхода,
		|	СметныеЦеныРесурсовСрезПоследних.СметнаяЦена,
		|	СметныеЦеныРесурсовСрезПоследних.Ресурс.ВидРесурса,
		|	ВременнаяТаблицаРесурсов.ТипРесурса,
		|	СметныеЦеныРесурсовСрезПоследних.ЗарплМашинистов";
		
	ТаблицаРесурсов = Объект.РесурсыНормативныхСборников.Выгрузить();
	
	Запрос.УстановитьПараметр("ТаблицаРесурсовИзДокумента", ТаблицаРесурсов);
	Запрос.УстановитьПараметр("СНБ", РегиональнаяБаза);
	Запрос.УстановитьПараметр("Район", Район);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	РасчетСтоимостиПоЦенамРесурсов.Очистить();
	РасчетСтоимостиПоЦенамРесурсов.Загрузить(РезультатЗапроса);  	
	
	МассивОЗ = РасчетСтоимостиПоЦенамРесурсов.НайтиСтроки(Новый Структура("ВидРесурса", Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаРабочих));
	Для Каждого ЭлементМассива Из МассивОЗ Цикл
	    СуммаОЗ = СуммаОЗ + ЭлементМассива.СтоимостьРесурса;
	КонецЦикла;
	
	МассивЭММ = РасчетСтоимостиПоЦенамРесурсов.НайтиСтроки(Новый Структура("ВидРесурса, ТипРесурса", Перечисления.СМ_ВидыРесурсов.МашиныИМеханизмы, Перечисления.СМ_ТипыМатериалов.Учтенный));
	Для Каждого ЭлементМассива Из МассивЭММ Цикл
	    СуммаЭММ = СуммаЭММ + ЭлементМассива.СтоимостьРесурса;
	КонецЦикла;
	
	МассивСМ = РасчетСтоимостиПоЦенамРесурсов.НайтиСтроки(Новый Структура("ВидРесурса, ТипРесурса", Перечисления.СМ_ВидыРесурсов.Материалы, Перечисления.СМ_ТипыМатериалов.Учтенный));
	Для Каждого ЭлементМассива Из МассивСМ Цикл
	    СуммаСМ = СуммаСМ + ЭлементМассива.СтоимостьРесурса;
	КонецЦикла;
	
	МассивЗМ = РасчетСтоимостиПоЦенамРесурсов.НайтиСтроки(Новый Структура("ВидРесурса, ТипРесурса", Перечисления.СМ_ВидыРесурсов.МашиныИМеханизмы, Перечисления.СМ_ТипыМатериалов.Учтенный));
	Для Каждого ЭлементМассива Из МассивЗМ Цикл
	    СуммаЗМ = СуммаЗМ + ЭлементМассива.ЗарплатаМашинистов * ЭлементМассива.НормаРасхода;
	КонецЦикла;
	
	СтрокаЦен.ОсновнаяЗарплата = СуммаОЗ;
	СтрокаЦен.ЭксплуатацияМашинИМеханизмов = СуммаЭММ;
	СтрокаЦен.ВТомЧислеЗарплатаМашинистов = СуммаЗМ;
	СтрокаЦен.СтоимостьМатериалов = СуммаСМ;
			
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОборудование(Результат, Оборудование) Экспорт
	
	ОбнулитьКолонки = Ложь;
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОбнулитьКолонки = Истина;
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		ОбщегоНазначенияКЛиентСервер.СообщитьПользователю(НСтр("ru='В расценке могут быть записаны неверные ценовые параметры'"));
		Возврат;		
	КонецЕсли;
	
	ОЗ 		= Объект.ЦеныНормативныхСборников.Итог("ОсновнаяЗарплата");
	ПЗ 		= Объект.ЦеныНормативныхСборников.Итог("ПрямыеЗатраты");
	ЭММ		= Объект.ЦеныНормативныхСборников.Итог("ЭксплуатацияМашинИМеханизмов");
	ЗМ 		= Объект.ЦеныНормативныхСборников.Итог("ВТомЧислеЗарплатаМашинистов");
	СМ 		= Объект.ЦеныНормативныхСборников.Итог("СтоимостьМатериалов");
	ВМ 		= Объект.ЦеныНормативныхСборников.Итог("ВозвратМатериалов");
	
	ПараметрСтр = Новый Структура();
	ПараметрСтр.Вставить("Оборудование", Оборудование);
	ПараметрСтр.Вставить("ОбнулитьКолонки", ОбнулитьКолонки);
	
	Если Оборудование И (ПЗ+ОЗ+ЭММ+ЗМ+СМ+ВМ <> 0) Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеНеОборудование", ЭтаФорма, ПараметрСтр);
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru='Позиция является оборудованием. Обнулить прямые затраты и их составляющие?'"), РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ОповещениеНеОборудование(КодВозвратаДиалога.Отмена, ПараметрСтр);
		
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ОповещениеНеОборудование(Результат, ПараметрСтр) Экспорт
	
	ОбнулитьКолонки = ПараметрСтр.ОбнулитьКолонки;
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОбнулитьКолонки = Истина;
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		ОбщегоНазначенияКЛиентСервер.СообщитьПользователю(НСтр("ru='В расценке могут быть записаны неверные ценовые параметры'"));
		Возврат;		
	КонецЕсли;
	
	СписокРасхожденийПоПЗ = Новый СписокЗначений();
	
	СписокРасхожденийПоЭМ = Новый СписокЗначений();
	
	Если Не ПараметрСтр.Оборудование Тогда
		
		Для Каждого СтрокаЦен Из Объект.ЦеныНормативныхСборников Цикл
			
			Если (СтрокаЦен.ПрямыеЗатраты <> СтрокаЦен.ОсновнаяЗарплата + СтрокаЦен.ЭксплуатацияМашинИМеханизмов + СтрокаЦен.СтоимостьМатериалов) Тогда
				СписокРасхожденийПоПЗ.Добавить(СтрокаЦен);
			КонецЕсли;
				
			Если (СтрокаЦен.ЭксплуатацияМашинИМеханизмов < СтрокаЦен.ВТомЧислеЗарплатаМашинистов) Тогда
				СписокРасхожденийПоЭМ.Добавить(СтрокаЦен);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("СписокРасхожденийПоПЗ", СписокРасхожденийПоПЗ);
	СтруктураПараметров.Вставить("СписокРасхожденийПоЭМ", СписокРасхожденийПоЭМ);
	СтруктураПараметров.Вставить("ОбнулитьКолонки", ОбнулитьКолонки);

	Если (СписокРасхожденийПоПЗ.Количество() > 0) Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеРасхожденияПЗ", ЭтаФорма, СтруктураПараметров);
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru='В таблице цен обнаружены строки, в которых Прямые затраты не равны сумме составляющих. Будет произведен пересчет. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ОповещениеРасхожденияПЗ(КодВозвратаДиалога.Отмена, СтруктураПараметров);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеРасхожденияПЗ(Результат, СтруктураПараметров) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		ОбщегоНазначенияКЛиентСервер.СообщитьПользователю(НСтр("ru='В расценке могут быть записаны неверные ценовые параметры'"));
		Возврат;		
	КонецЕсли;
	
	Если (СтруктураПараметров.СписокРасхожденийПоЭМ.Количество() > 0) Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеРасхожденияЭМ", ЭтаФорма, СтруктураПараметров);
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru='В таблице цен обнаружены строки, в которых Эксплуатация машин меньше зарплаты машинистов. Будет произведен пересчет стоимости эксплуатации машин. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ОповещениеРасхожденияЭМ(КодВозвратаДиалога.Отмена, СтруктураПараметров);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеРасхожденияЭМ(Результат, СтруктураПараметров) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		ОбщегоНазначенияКЛиентСервер.СообщитьПользователю(НСтр("ru='В расценке могут быть записаны неверные ценовые параметры'"));
		Возврат;		
	КонецЕсли;
	
	Если (СтруктураПараметров.ОбнулитьКолонки ИЛИ (СтруктураПараметров.СписокРасхожденийПоПЗ.Количество() > 0) ИЛИ (СтруктураПараметров.СписокРасхожденийПоЭМ.Количество() > 0)) Тогда
	
		ОбработатьТаблицуЦен(СтруктураПараметров.СписокРасхожденийПоПЗ, СтруктураПараметров.СписокРасхожденийПоЭМ, СтруктураПараметров.ОбнулитьКолонки);
		
	КонецЕсли;
	
КонецПроцедуры  
	
&НаКлиенте
Процедура ПроверитьЗначения(Отказ)
	
	
	Если ВидРасценки = ПредопределенноеЗначение("Перечисление.СМ_ВидыРасценки.Оборудование") Тогда
		Оборудование = Истина;
	Иначе
		Оборудование = Ложь;
	КонецЕсли;
	
	ОБ 		= Объект.ЦеныНормативныхСборников.Итог("СтоимостьОборудования");
	
	Если Не Оборудование И (ОБ <> 0) Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеОборудование", ЭтаФорма, Оборудование);
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru='Позиция не является оборудованием. Обнулить стоимость оборудования?'"), РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ОповещениеОборудование(КодВозвратаДиалога.Отмена, Оборудование);
		
	КонецЕсли;
	
	
		
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьЗначенияТаблицы(ТекДанные, НеПредупреждать = Ложь)
	
	Если ВидРасценки = ПредопределенноеЗначение("Перечисление.СМ_ВидыРасценки.Оборудование") Тогда
		ТекДанные.ПрямыеЗатраты = 0;// ТекДанные.СтоимостьОборудования;
		ТекДанные.ОсновнаяЗарплата = 0;
		ТекДанные.ЭксплуатацияМашинИМеханизмов = 0;
		ТекДанные.ВТомЧислеЗарплатаМашинистов = 0;
		ТекДанные.СтоимостьМатериалов = 0;
		ТекДанные.ВозвратМатериалов = 0;
		ТекДанные.НакладныеРасходыСумма = 0;
		ТекДанные.СметнаяПрибыльСумма = 0;
		ТекДанные.ПроцентНР = 0;
		ТекДанные.ПроцентСП = 0;
	Иначе
		ТекДанные.ПрямыеЗатраты = ТекДанные.ОсновнаяЗарплата + ТекДанные.ЭксплуатацияМашинИМеханизмов + ТекДанные.СтоимостьМатериалов;
		ТекДанные.СтоимостьОборудования = 0;
		ТекДанные.НакладныеРасходыСумма=(ТекДанные.ОсновнаяЗарплата+ТекДанные.ВТомЧислеЗарплатаМашинистов)*ТекДанные.ПроцентНР/100;
		ТекДанные.СметнаяПрибыльСумма=(ТекДанные.ОсновнаяЗарплата+ТекДанные.ВТомЧислеЗарплатаМашинистов)*ТекДанные.ПроцентСП/100;
	КонецЕсли;
	
	Если ТекДанные.ЭксплуатацияМашинИМеханизмов < ТекДанные.ВТомЧислеЗарплатаМашинистов Тогда
		Если Не НеПредупреждать Тогда
			ПоказатьПредупреждение(,НСтр("ru='Заработная плата машинистов не может быть больше эксплуатации машин и механизмов.'"),30);
		КонецЕсли;
		ТекДанные.ЭксплуатацияМашинИМеханизмов = ТекДанные.ВТомЧислеЗарплатаМашинистов;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьТаблицуЦен(СписокРасхожденийПоПЗ, СписокРасхожденийПоЭМ, ВсеКолонки)
	
	Для Каждого ТекДанные Из Объект.ЦеныНормативныхСборников Цикл
		
		Если ВсеКолонки ИЛИ (СписокРасхожденийПоПЗ.НайтиПоЗначению(ТекДанные)<>Неопределено) ИЛИ (СписокРасхожденийПоЭМ.НайтиПоЗначению(ТекДанные)<>Неопределено) Тогда
			
			РассчитатьЗначенияТаблицы(ТекДанные, Истина);
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаОсновании(ОбъектСправочника)
	Сборник = ОбъектСправочника.Родитель;
	ЗаполнитьЗначенияСвойств(ОбъектСправочника, Сборник, "ТипНормативногоСборника,УровеньЦен");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображение()

	Если ВидРасценки = ПредопределенноеЗначение("Перечисление.СМ_ВидыРасценки.Оборудование") Тогда
		Оборудование = Истина;
	Иначе
		Оборудование = Ложь;
	КонецЕсли;
	
	Элементы.ГруппаЦеныНормативныхСборников.Доступность = НЕ Объект.Ссылка.Пустая();
	Элементы.ГруппаРесурсыНормативныхСборников.Доступность = НЕ Объект.Ссылка.Пустая();
	Элементы.ГруппаСоставРабот.Доступность = НЕ Объект.Ссылка.Пустая();
	
	Элементы.ЦеныНормативныхСборниковСтоимостьОборудования.Видимость = Оборудование;
	Элементы.ЦеныНормативныхСборниковСметнаяПрибыльСумма.Видимость = НЕ Оборудование;
	Элементы.ЦеныНормативныхСборниковНакладныеРасходыСумма.Видимость = НЕ Оборудование;
	Элементы.ЦеныНормативныхСборниковПроцентНР.Видимость = НЕ Оборудование;
	Элементы.ЦеныНормативныхСборниковПроцентСП.Видимость = НЕ Оборудование;
	Элементы.ЦеныНормативныхСборниковПрямыеЗатраты.Видимость = НЕ Оборудование;
	Элементы.ЦеныНормативныхСборниковОсновнаяЗарплата.Видимость = НЕ Оборудование;
	Элементы.ЦеныНормативныхСборниковЭксплуатацияМашинИМеханизмов.Видимость = НЕ Оборудование;
	Элементы.ЦеныНормативныхСборниковВТомЧислеЗарплатаМашинистов.Видимость = НЕ Оборудование;
	Элементы.ЦеныНормативныхСборниковСтоимостьМатериалов.Видимость = НЕ Оборудование;
	Элементы.ЦеныНормативныхСборниковВозвратМатериалов.Видимость = НЕ Оборудование;
	
КонецПроцедуры

&НаКлиенте
Процедура РесурсыНормативныхСборниковПриИзменении(Элемент)
	
	ТекДанные = Элементы.РесурсыНормативныхСборников.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	НайденныеСтроки = Объект.РесурсыНормативныхСборников.НайтиСтроки(Новый Структура("Ресурс",ТекДанные.Ресурс));
	Если НайденныеСтроки.Количество() > 1 Тогда
		Объект.РесурсыНормативныхСборников.Удалить(Объект.РесурсыНормативныхСборников.Индекс(ТекДанные));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Строка с таким ресурсом уже есть в табличной части'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныНормативныхСборниковРегиональнаяБазаПриИзменении(Элемент)
	МассивРайонов = ПолучитьСписокРайоновИзРегБазы(Элементы.ЦеныНормативныхСборников.ТекущиеДанные.РегиональнаяБаза);
	Элементы.ЦеныНормативныхСборниковРайон.СписокВыбора.ЗагрузитьЗначения(МассивРайонов);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокРайоновИзРегБазы(РегБаза)
	Массив = РегБаза.Районы.ВыгрузитьКолонку("ТерриториальныйРайон");
	Возврат Массив;
КонецФункции

&НаКлиенте
Процедура РесурсыНормативныхСборниковПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И Не Копирование Тогда
		ТекДанные = Элементы.РесурсыНормативныхСборников.ТекущиеДанные;
		ТекДанные.ТипРесурса = ПредопределенноеЗначение("Перечисление.СМ_ТипыМатериалов.Учтенный");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоставРаботПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекДанные = Элементы.СоставРабот.ТекущиеДанные;
		ТекДанные.Номер = Объект.СоставРабот.Количество();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РесурсыНормативныхСборниковРесурсОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.СМ_Ресурсы") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Результат	= СМ_СметаКлиент.ПолучитьОдинРесурсИзМассива(ВыбранноеЗначение);
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.РесурсыНормативныхСборников.ТекущиеДанные;
	ТекДанные.Ресурс = Результат;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаКлиенте
Процедура ЦеныНормативныхСборниковПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.РегиональнаяБаза=Объект.СметноНормативнаяБаза;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область НаУдаление

//&НаСервере
//Процедура СвойстваВыполнитьОтложеннуюИнициализацию()
//	
//	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
//		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
//		МодульУправлениеСвойствами.ЗаполнитьДополнительныеРеквизитыВФорме(ЭтотОбъект);
//	КонецЕсли;
//	
//КонецПроцедуры

#КонецОбласти
